Repository: algorb/thbook_ru
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: * || = conditional; true iff |legend| option of the |layout| command was set to |on| or |all| values * || = token register containing translated legend title * || = macro for inserting legend symbols pictures with translated descriptions in the specified number of columns (according to |legend-columns| layout option) * || = combines all three above commands to get preformatted legend with header and symbols typeset in twoDefault; adjust the |legend-columns| layout option to get them more or less] columns if |legend| option is set |on|
ru_ru: * || = условный; true если опция |legend| команды |layout| была\break установлена в |on| или |all|; * || = регистровый токен, содержащий переведенное название\break легенды; * || = макрос для вставки изображений символов легенды с\break переведенными описаниями в указанное количество столбцов (в\break соответствии с опцией |legend-columns| макета); * || = объединяет все три приведенные выше команды, чтобы получить предварительно отформатированную легенду с заголовком и\break символами в двухЗначение по умолчанию; устанавливайте опцию |legend-columns| макета, чтобы указать количество столбцов.] столбцах, если опция |legend| установлена в |on|.

source: * || = name of the current map according to options of the |map| command.
ru_ru: * || = имя текущей карты в соответствии с опциями команды |map|.

source: * || = the page label as specified by |origin| and |origin-label| options of the |layout| command.
ru_ru: * || = метка страницы, указанная опциями |origin| и |origin-label| в команде |layout|.

source: * || current page number
ru_ru: * || содержит номер текущей страницы.

source: * || has three arguments (page-name, page-number, destination) and visualizes these data.
ru_ru: * || имеет три аргумента -- page-name (название страницы), page-number (номер страницы), destination (место отображения), и выводит эти данные.

source: * || with one of the || or || as an argument presents the content of this argument.
ru_ru: * || с одним из аргументов || или ||\break представляет содержание этого аргумента.

source: * || with one of the ||, ||, || or || as an argument displays the value of the argument.
ru_ru: * || с одним из ||, ||, || или || в качестве аргумента отображает значение аргумента.

source: * ||, || = page dimensions, set according to |page-width| and |page-height| parameters of the |page-setup| option of the |layout| command.
ru_ru: * ||, || = размеры страницы, заданные в соответствии с\break параметрами |page-width| и |page-height| опции |page-setup| команды |layout|.

source: * ||, || contain information about pages above and below the current page.
ru_ru: * ||, || содержат информацию о страницах выше и ниже текущей страницы.

source: * ||, ||, || = translated titles * ||, ||, || = participating members (according to |team|, |explo-team| options for |centreline| and |author| option of scraps) * ||, ||, || = corresponding dates * || = is set according to |map-comment| option of the |layout| command * || = is set according to copyright options for surveys and other objects * || = name of the exported map; set according to |-title| option of exported map * ||, || = approximate length and depth of displayed map * |title|, |title| = translated labels * {5.4}||, || = altitude max/min value * {5.4}|| = current therion version * {5.4}|| = current date * {5.4}||, || = output coordinat system code and name * {5.4}|| = `true' or `grid' * {5.4}|| = magnetic declination in degrees * {5.4}|| = grid meridian convergence in degrees
ru_ru: * ||, ||, || = перевод названий; * ||, ||, || = участники (в соответствии с опциями |team|, |explo-team| команды |centreline| и опции |author| для скрапов); * ||, ||, || = соответствующие даты; * || = задано в соответствии с опцией |map-comment| команды |layout|; * || = устанавливается в соответствии с вариантами авторского права для съемок и других объектов; * || = имя экспортируемой карты, устанавливается в соответствии с опцией |-title| экспортируемой карты; * ||, || = приблизительная длина и глубина отображаемой карты; * |title|, |title| = переведенные метки; * {5.4}||, || = значение высоты max/min; * {5.4}|| = текущая версия Therion'а; * {5.4}|| = текущая дата; * {5.4}||, || = вывести код и наименование системы координат; * {5.4}|| = `true' или `grid'; * {5.4}|| = магнитное склонение в градусах; * {5.4}|| = конвергенция сетки меридиана в градусах.

source: * ||, ||, ||, || contain the page number of the neighbouring pages in the E, W, N and S directions.
ru_ru: * ||, ||, ||, || содержат номер страницы\break соседних страниц в направлениях E, W, N и S.

source: * ||, ||, ||, |ß|, || for type face switching.
ru_ru: * ||, ||, ||, |\ss|, || для изменения типа отображения.

source: * |<x>| and |<y>| are the drawing coordinates of an object.
ru_ru: * |<x>| и |<y>| являются координатами чертежа объекта.

source: * |EPSG:<number>| = Most of EPSG coordinate systems.
ru_ru: * |EPSG:<число>| =Большинство систем координат EPSG.

source: * |ESRI:<number>| = Similar to EPSG, but ESRI standard.
ru_ru: * |ESRI:<число>| = Аналогично EPSG, но стандарт ESRI.

source: * |JTSK03|, |iJTSK03| = new S-JTSK realisation introduced in Slovakia in 2011.
ru_ru: * |JTSK03|, |iJTSK03| = Новая реализация S-JTSK, введенная в Словакии в 2011 году.

source: * |JTSK|, |iJTSK| = Czechoslovak S-JTSK system used since 1920s with south and west axis (JTSK) and its modified version with axis pointing east and north and negative numbers (iJTSK).
ru_ru: * |JTSK|, |iJTSK| = Чехословацкая система S-JTSK, используемая с 1920-х годов с южной и западной осью (JTSK) и ее модифицированной версией с осью, указывающей восток и север отрицательными числами (iJTSK).

source: * |OSGB:<H, N, O, S or T><A-Z except I>| = British Ordnance Survey National Grid.{5.4} * |S-MERC| = the spherical Mercator projection, as used by various online mapping sites.
ru_ru: * |OSGB:<H, N, O, S или T><A-Z исключая I>| = Британская Национальная Сеть.{5.4} * |S-MERC| = Сферическая проекция Меркатора, используемая различными сайтами онлайн-сопоставления.

source: * |THERION| = [not required] search path for (x)therion.ini file(s) * |HOME| (|HOMEDRIVE| + |HOMEPATH| on WinXP) = [not required, but usually present on your system] search path for (x)therion.ini file(s) * |TEMP|, |TMP| = system temporary directory, where Therion stores temporary files (in a directory named |th$PID$|, where |$PID$| is a process ID), unless |tmp-path| is specified in the initialization file.
ru_ru: * |THERION| = [не требуется] путь поиска для файла(ов) (x)therion.ini; * |HOME| (|HOMEDRIVE| + |HOMEPATH| на WinXP) = [не требуется, но обычно присутствует в вашей системе] путь поиска для файла(ов) (x)therion.ini; * |TEMP|, |TMP| = системный временный каталог, где Therion хранит\break временные файлы (в каталоге с именем |th$PID$|, где |$PID$| является\break идентификатором процесса), если только |tmp-path| указан в файле\break инициализации.

source: * |UTM1N| -- |UTM60N| = same as |UTM1| -- |UTM60| * |UTM1S| -- |UTM60S| = UTM in southern hemisphere, WGS84 datum.
ru_ru: * |UTM1N| -- |UTM60N| = То же, что и |UTM1| -- |UTM60|. * |UTM1S| -- |UTM60S| = UTM в южном полушарии, WGS84.

source: * |UTM1| -- |UTM60| = Universal Transverse Mercator in northern hemisphere and given zone, WGS84 datum.
ru_ru: * |UTM1| -- |UTM60| = Универсальная поперечная проекция Меркатора\break (Universal Transverse Mercator) в северном полушарии и заданной зоне, WGS84.

source: * |[LINE DATA]| specify either the coordinates of a line segment |<x> <y>|, or coordinates of a Bezier curve arc |<c1x> <c1y> <c2x> <c2y> <x> <y>|, where |c| indicates the control point.
ru_ru: * |[ДАННЫЕ ЛИНИИ]| указывает либо координаты отрезка |<x> <y>|, либо\break координаты кривой Безье |<c1x> <c1y> <c2x> <c2y> <x> <y>|, где |c|\break указывает контрольную точку.

source: * |[grid data]| = a stream of numbers giving the altitude a.s.l. in grid nodes.
ru_ru: * |[grid data]| = поток чисел, дающий высоту a.s.l. в узлах сетки.

source: * |adjust <horizontal/vertical>| = shifts the line point to be aligned horizontally/ver­ti­cally with the previous point (or next point if there is no previous point).
ru_ru: * |adjust <horizontal/vertical>| = сдвигает точку линии, которая должна быть выровнена по горизонтали/вертикали с предыдущей точкой (или\break следующей точкой, если нет предыдущей точки).

source: * |align| = alignment of the symbol or text.
ru_ru: * |align| = выравнивание символа или текста.

source: * |altitude <value>| = can be specified only with the wall type.
ru_ru: * |altitude <значение>| = могут быть указаны только с типом |wall| (стена).

source: * |attributes <(on)/off>| = set whether to export user defined attributes in continuation list table.
ru_ru: * |attributes <(on)/off>| = указывает, следует ли экспортировать определенные пользователем атрибуты в таблице списка продолжений (перспектив).

source: * |author <date> <person>| = author of the data and its creation date * |copyright <date> <string>| = copyright date and name * |title <string>| = description of the object
ru_ru: * |author <дата> <персона>| = автор данных и дата их создания. * |copyright <дата> <текст>| = авторские права и их дата. * |title <текст>| = описание объекта.

source: * |border <on/off>| = this option can be specified only with the `slope' symbol type.
ru_ru: * |border <on/off>| = эта опция может быть указана только с типом символа `slope' (склон).

source: * |break| = can be used with interleaved data to separate two traverses * |mark [<station list>] <type>| = set the type of named stations.
ru_ru: * |break| = может использоваться между данными, чтобы отделить два\break пересечения. * |mark [<список станций>] <тип>| = установить тип именованных станций.

source: * |calibrate <quantity list> <zero error> [<scale>]| = set the instrument calibration.
ru_ru: * |calibrate <параметр> <ошибка> [<масштаб>]| = установка калибровки\break прибора.

source: * |chapter-level <number>| = valid only when a map is selected.
ru_ru: * |chapter-level <число>| = действует только при выборе карты.

source: * |clip <on/off>| = specify whether a symbol is clipped by the scrap border.
ru_ru: * |clip <on/off>| = указывает, подрезать ли символ границей скрапа.

source: * |close <on/off/auto>| = determines whether a line is closed or not * |mark <keyword>| = is used to mark the point on the line (see |join| command).
ru_ru: * |close <on/off/auto>| = определяет, закольцована ли линия или нет. * |mark <keyword>| = используется для маркировки точки на линии (см.\break команду |join|).

source: * |code <metapost/tex-map/tex-atlas>| = Add/redefine and macros here.
ru_ru: * |code <metapost/tex-map/tex-atlas>| = Добавить/переопределить макросы\break и .

source: * |colo[u]r <color>| = set the map colour; this option overrides the automatic choice when the layout specifies |colour map-fg [map]|.
ru_ru: * |colo[u]r <цвет>| = установить цвет карты; эта опция отменяет\break автоматический выбор, когда макет определяет |colour map-fg [map]|.

source: * |config-linux|, |config-macosx|, |config-win32| = configure Therion for a specific platform.
ru_ru: * |config-linux|, |config-macosx|, |config-win32| = настроить Therion для\break конкретной платформы.

source: * |config-release|, |config-oxygen|, |config-ozone| = set optimization level for C++ compiler (none, |-O2| and |-O3|) * |config-debug| = useful before debugging the program * |install| = install Therion * |clean| = delete all temporary files
ru_ru: * |config-release|, |config-oxygen|, |config-ozone| = установить уровень\break оптимизации для компилятора C++ (none, |-O2| или |-O3|); * |config-debug| = полезно перед отладкой программы; * |install| = установить Therion; * |clean| = удалить все временные файлы.

source: * |context <point/line/area> <symbol-type>| = (to be used with |symbol-hide| and |symbol-show| layout options) symbol will be hidden/shown according to rules for specified |<symbol-type>|.
ru_ru: * |context <point/line/area> <тип символа>| = (для использования с опциями |symbol-hide| (скрыть символ) и |symbol-show| (отображать символ) команды |layout|) будет скрыт/показан в соответствии с правилами для указанного |<типа символа>|.

source: * |context <point/line/area> <symbol-type>| = (to be used with |symbol-hide| and |symbol-show| layout options) symbol will be hidden/shown according to rules for specified |<symbol-type>|.Example: if you specify |-context point air-draught| to a label which displays the observation date, the |symbol-hide point air-draught| command would hide both air-draught arrow and the corresponding label.] * |id <ext_keyword>| = ID of the symbol.
ru_ru: * |context <point/line/area> <тип символа>| = (для использования с опциями |symbol-hide| (скрыть символ) и |symbol-show| (отобразить символ) в layout) символ будет скрыт/показан в соответствии с правилами для указанного |<типа символа>|Пример: если вы укажете |-context point air-draught| текстовую метку, на которой отображается дата наблюдения, команда |symbol-hide point air-draught| скроет стрелку ток воздуха и соответствующую ей текстовую метку.]. * |id <идентификатор>| = идентификатор символа.

source: * |convert-path <file-path>|
ru_ru: * |convert-path <путь файла>|

source: * |copy <source layout id>| = set properties here that are not modified based on the given source layout.
ru_ru: * |copy <идентификатор исходного макета>| = устанавливаются свойства\break макета, которые берутся из данных исходного макета.

source: * |count <N>| (when used with scraps) = Therion will try to join scraps which connect in |N| locations/passages.
ru_ru: * |count <N>| (при использовании со скрапами) = Therion попытается\break подсоединиться к скрапам, которые соединяются в |N| месте/хода.

source: * |cs <coordinate system>|
ru_ru: * |cs <система координат>|

source: * |cs <coordinate system>| = assumes that (calibrated) local scrap coordinates are given in specified coordinate system.
ru_ru: * |cs <система координат>| = предполагается, что (калиброванные) локальные координаты скрапа приведены к заданной системе координат.

source: * |cs <coordinate system>| = coordinate system for bitmap calibration and grid origin specification * |bitmap <filename> <calibration>| = scanned topographical map.
ru_ru: * |cs <система координат>| = система координат для калибровки растровой карты и определения начала сетки. * |bitmap <имя файла> <калибровка>| = сканированная топографическая\break карта.

source: * |cs <coordinate system>| = coordinate system for stations with fixed coordinates * |fix <station> [<x> <y> <z> [<std x> <std y> <std z>]]| = fix station coordinates (with specified errors---only the units transformation, not calibration, is applied to them).
ru_ru: * |cs <система координат>| = система координат для станций с\break фиксированными координатами. * |fix <станция> [<x> <y> <z> [<std x> <std y> <std z>]]| = фиксировать координаты станции (с указанными ошибками -- к ним применяется только преобразование единиц, а не калибровка).

source: * |date <date>| = survey date.
ru_ru: * |date <дата>| = дата съемки.

source: * |debug <on/all/first/second/scrap-names/station-names/off>| = draw scrap in different stages of transformation in different colours to see how Therion distorts map data.
ru_ru: * |debug <on/all/first/second/scrap-names/station-names/off>| = рисовать скрап на разных этапах преобразования в разных цветах, чтобы увидеть, как Therion искажает данные карты.

source: * |direction <begin/end/both/none/point>| = can be used only with the section type.
ru_ru: * |direction <begin/end/both/none/point>| = может использоваться только с типом `section' (сечение).

source: * |dist <distance>| = valid for extra points, specifies the distance to the nearest station (or station specified using |-from| option.
ru_ru: * |dist <дистанция>| = применяется для дополнительных точек, указывает расстояние до ближайшей станции (или станции, указанной с помощью опции |-from|.

source: * |doc-author <string>| = set document author (M, A) * |doc-keywords <string>| = set document keywords (M, A) * |doc-subject <string>| = set document subject (M, A) * |doc-title <string>| = set document title (M, A)
ru_ru: * |doc-author <текст>| = установить автора документа (M, A). * |doc-keywords <текст>| = установить ключевые слова документа (M, A). * |doc-subject <текст>| = задать тему документа (M, A). * |doc-title <текст> | = установить название документа (M, A).

source: * |enable <walls/[cave/surface-]centerline/splay-shots/surface/all>| and * |disable <walls/[cave/surface-]centerline/splay-shots/surface/all>| = selects which features to export, if the format supports it.
ru_ru: * |enable <walls/[cave/surface-]centerline/splay-shots/surface/all>| и * |disable <walls/[cave/surface-]centerline/splay-shots/surface/all>| = выбирает, какие функции экспортировать, если формат поддерживает его.\break

source: * |encoding-default <encoding-name>|
ru_ru: * |encoding-default <имя кодировки>|

source: * |encoding-sql <encoding-name>|
ru_ru: * |encoding-sql <имя кодировки>|

source: * |encoding/enc <encoding>| = set output encoding
ru_ru: * |encoding/enc <кодировка>| = установить кодировку вывода.

source: * |endcode| = should end the TeXand sections endcomopt
ru_ru: * |endcode| = должен заканчивать разделы TeXи .endcomopt

source: * |entrance <station-name>| = specifies the main entrance to the cave represented by this survey.
ru_ru: * |entrance <имя-станции>| = указывает главный вход в пещеру,\break представленный в этом survey.

source: * |equate <station list>| = set points that are equivalent * |data <style> <readings order>| = set data style (normal, topofil, diving, cartesian, cylpolar, dimensions, nosurvey) and readings order.
ru_ru: * |equate <список станций>| = эквивалентность заданных точек. * |data <стиль> <порядок считывания>| = установить стиль данных (normal, topofil, diving, cartesian, cylpolar, dimensions, nosurvey) и порядок\break считывания.

source: * |explo-date <date>| = discovery date.
ru_ru: * |explo-date <дата>| = дата исследования.

source: * |explo-team <person>| = a discovery team member.
ru_ru: * |explo-team <персона>| = член исследовательского отделения.

source: * |explored <length>| = if the point type is continuation, you can specify length of passages explored but not surveyed yet.
ru_ru: * |explored <длина>| = если тип точки -- это continuation (продолжение,\break возможное продолжение), то вы можете указать длину ходов,\break исследованных, но пока не снятых.

source: * |export <type> [OPTIONS]|
ru_ru: * |export <тип> [ОПЦИИ]|

source: * |extend <spec> [<station> [<station>]]| = control how the centerline is extended.
ru_ru: * |extend <spec> [<станция> [<станция>]]| = определение развертки нитки хода.

source: * |extend [prev[ious] <station>]| = if the point type is station and scrap projection is extended elevation, you can adjust the extension of the centreline using this option.
ru_ru: * |extend [prev[ious] <станция>]| = если тип точки -- это station (станция), а скрап является extended elevation (разрез-разверткой), то вы можете регулировать развертку нитки хода, используя эту опцию.

source: * |filter <prefix>| = if specified, only stations with given prefix and shots between them will be imported.
ru_ru: * |filter <префикс>| = если указано, то будут импортированы только станции с заданным префиксом и замеры между ними.

source: * |flags <shot flags>| = set flags for following shots.
ru_ru: * |flags <флаги замеров>| = установить флаги для следующих замеров.\break

source: * |format/fmt <format>| = currently |sql| and |csv| * |encoding/enc <encoding>| = set output encoding
ru_ru: * |format/fmt <формат>| = в настоящее время поддерживаются форматы |sql| и |csv|. * |encoding/enc <кодировка>| = установить кодировку вывода.

source: * |format/fmt <format>| = set continuation output format.
ru_ru: * |format/fmt <формат>| = установить формат списка возможных\break продолжений (перспектив).

source: * |format/fmt <format>| = set map format.
ru_ru: * |format/fmt <формат>| = установить формат карты.

source: * |format/fmt <format>| = set model output format.
ru_ru: * |format/fmt <формат>| = установить формат вывода модели.

source: * |from <station>| = valid for extra points, specifies reference station.
ru_ru: * |from <станция>| = применяется для дополнительных точек, указывает\break опорную станцию.

source: * |grade <grade list>| = sets standard deviations according to the survey grade specification (see grade command).
ru_ru: * |grade <grade list>| = устанавливает стандартные отклонения для угла\break наклона съемки (смотрите команду grade).

source: * |gradient <none/center/point>| = can be used only with the contour type and indicates where to put a gradient mark on the contour line.
ru_ru: * |gradient <none/center/point>| = может использоваться только с типом\break `contour' (контур) и указывает, где расположить градиентную метку на контурной линии.

source: * |grid-angle <value> <units>| = specifies the magnetic grid angle (declination against grid north).
ru_ru: * |grid-angle <значение> <единицы>| = задает угол магнитной сетки\break (склонение от направления на север).

source: * |grid-flip (none)/vertical/horizontal| = useful if your grid (exported from other program) needs to be flipped
ru_ru: * |grid-flip (none)/vertical/horizontal| = полезно, если ваша сетка\break (экспортированная из другой программы) должна быть перевернута.

source: * |grid-origin <x> <y> <x> <units>| = set coordinates of grid origin (M, A) * |grid-size <x> <y> <z> <units>| = set grid size in real units (M, A; default is equal to scalebar size) * |grid-coords <off/border/all>| = specify where to label grid with coordinates.
ru_ru: * |grid-origin <x> <y> <x> <единицы> | = заданные координаты начала сетки (M, A). * |grid-size <x> <y> <z> <единицы>| = задать размер сетки в реальных\break единицах (M, A, по умолчанию равен размеру шкалы). * |grid-coords <off/border/all>| = указать, где маркировать сетку\break координатами.

source: * |grid-units <units>| = units in which grid is specified.
ru_ru: * |grid-units <единицы>| = единицы, в которых задана сетка.

source: * |group| * |endgroup| = |group/endgroup| pair enables the user to make temporary changes in almost any setting (calibrate, units, sd, data, flags...) * |walls <auto/on/off>| = turn on/off passage shape generation from LRUD data for subsequent shots.
ru_ru: * |group| * |endgroup| = |group/endgroup| пара позволяет пользователю делать\break временные изменения практически в любых настройках (калибровка,\break единицы, sd, данные, флаги...). * |walls <auto/on/off>| =включение/выключение генерации формы хода из данных LRUD для последующих замеров.

source: * |head <begin/end/both/none>| = can be used only with the arrow type and indicates where to put an arrow head.
ru_ru: * |head <begin/end/both/none>| = может использоваться только с типом\break `arrow' (стрелка) и указывает, куда поставить стрелу.

source: * |id <ext_keyword>| = ID of the symbol.
ru_ru: * |id <идентификатор>| = идентификатор символа.

source: * |id <ext_keyword>| = id of the object * |author <date> <person>| = author of the data and its creation date * |copyright <date> <string>| = copyright date and name * |title <string>| = description of the object
ru_ru: * |id <идентификатор>| = идентификатор объекта. * |author <дата> <персона>| = автор данных и дата их создания. * |copyright <дата> <строка>| = дата и имя авторского права. * |title <строка>| = описание объекта.

source: * |identify-path <file-path>|
ru_ru: * |identify-path <путь файла>|
